public/datos/archivo.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:siiLR="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroLR.xsd"
    xmlns:sii="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroInformacion.xsd">
    <soapenv:Body>
        <siiLR:SuministroLRFacturasEmitidas xmlns:siiLR="siiR">
            <sii:Cabecera xmlns:sii="sii">
                <sii:IDVersionSii>1.1</sii:IDVersionSii>
                <sii:Titular>
                    <sii:NombreRazon>Ruben Ñuñez</sii:NombreRazon>
                    <sii:NIF>77856181p</sii:NIF>
                </sii:Titular>
                <sii:TipoComunicacion>A0</sii:TipoComunicacion>
            </sii:Cabecera>
            <siiLR:RegistroLRFacturasEmitidas>
                <sii:PeriodoLiquidacion xmlns:sii="sii">
                    <sii:Ejercicio>2026</sii:Ejercicio>
                    <sii:Periodo>12</sii:Periodo>
                </sii:PeriodoLiquidacion>
                <siiLR:IDFactura>
                    <sii:IDEmisorFactura xmlns:sii="sii">
                        <sii:NIF>77856181p</sii:NIF>
                    </sii:IDEmisorFactura>
                    <sii:NumSerieFacturaEmisor xmlns:sii="sii">333</sii:NumSerieFacturaEmisor>
                    <sii:FechaExpedicionFacturaEmisor xmlns:sii="sii">2023-05-26</sii:FechaExpedicionFacturaEmisor>
                </siiLR:IDFactura>
                <siiLR:FacturaExpedida>
                    <sii:TipoFactura xmlns:sii="sii">F1</sii:TipoFactura>
                    <siiLR:ClaveRegimenEspecialOTrascendencia>01</siiLR:ClaveRegimenEspecialOTrascendencia>
                    <siiLR:ImporteTotal>120</siiLR:ImporteTotal>
                    <siiLR:DescripcionOperacion>Muchas</siiLR:DescripcionOperacion>
                    <siiLR:Contraparte>
                        <siiLR:NombreRazon>Mobiliario sanchez S.l</siiLR:NombreRazon>
                        <siiLR:NIF />
                    </siiLR:Contraparte>
                    <siiLR:TipoDesglose>
                        <siiLR:DesgloseFactura>
                            <siiLR:Sujeta>
                                <siiLR:NoExenta>
                                    <siiLR:TipoNoExenta>S1</siiLR:TipoNoExenta>
                                    <siiLR:DesgloseIVA>
                                        <siiLR:DetalleIVA>
                                            <siiLR:TipoImpositivo>4</siiLR:TipoImpositivo>
                                            <siiLR:BaseImponible>115.2</siiLR:BaseImponible>
                                            <siiLR:CuotaRepercutida>4.8</siiLR:CuotaRepercutida>
                                            <siiLR:TipoRecargoEquivalencia>1.25</siiLR:TipoRecargoEquivalencia>
                                            <siiLR:CuotaRecargoEquivalencia>1.25</siiLR:CuotaRecargoEquivalencia>
                                        </siiLR:DetalleIVA>
                                    </siiLR:DesgloseIVA>
                                </siiLR:NoExenta>
                            </siiLR:Sujeta>
                        </siiLR:DesgloseFactura>
                    </siiLR:TipoDesglose>
                </siiLR:FacturaExpedida>
            </siiLR:RegistroLRFacturasEmitidas>
        </siiLR:SuministroLRFacturasEmitidas>
    </soapenv:Body>
</soapenv:Envelope>